Revit 2025 API
UnitSystem Enumeration
 A system of measurement: Metric or Imperial units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum UnitSystem
Public Enumeration UnitSystem
public enum class UnitSystem
type UnitSystem
Members
Member name | Value | Description
Metric | 0 |  Metric units.
Imperial | 1 |  Imperial units.
See Also
Reference
Autodesk.Revit.DB Namespace